Autodesk.Revit.DB.IModelExportContext.OnPoint(Autodesk.Revit.DB.PointNode)
This method is called when a 3D Point is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
node:
An output node that represents a Point.
Returns:
Return RenderNodeAction.Proceed if you wish to receive low-level geometry
(line segments) for this point, or otherwise return RenderNodeAction.Skip.
Since:
2016

Autodesk.Revit.DB.IModelExportContext.OnPolyline(Autodesk.Revit.DB.PolylineNode)
This method is called when a 3D Polyline is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
node:
An output node that represents a Polyline.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(polyline segments) for this polyline, or otherwise return RenderNodeAction.Skip.
Since:
2016

Autodesk.Revit.DB.IModelExportContext.OnCurve(Autodesk.Revit.DB.CurveNode)
This method is called when a 3D Curve is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
The curve can be one of the geometric object that derive from the Curve class, e.g. Line, Arc,
NurbeSpline, etc. To get to the specific properties of the particular class, the curve
obtained from the input node first needs to be cast accordingly depending on the curve's
actual type.
node:
An output node that represents a Curve.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this curve, or otherwise return RenderNodeAction.Skip.
Since:
2016

Autodesk.Revit.DB.IModelExportContext
An interface that is used in custom export to export 3D views of a Revit model.
Remarks:
An instance of a class that implements this interface is passed in as a
parameter of the Autodesk::Revit::DB::CustomExporter constructor.
The interface methods are then called at times of drawing entities that are
currently visible in the view being exported.
With this type of export context used to perform a custom export,
Revit will traverse the model and output the model's geometry
as if in the process of regular displaying or exporting a 3D View.
It means that any geometry which is visible in an open view
(taking any current visibility setting applicable to the view)
will be processed and output.
Since:
2016